In [1]:
import numpy as np
import pandas as pd

In [3]:
d = {'A':[1,2,np.nan],'B':[5,np.nan, np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
#method for dropping rows with missing values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [9]:
#Drop missing values in columns
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [13]:
#setting a thresh condition, means if na is more than 1 then drop the row
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [15]:
#Filling missing value
df.fillna(value = 'Filled')

        A       B  C
0     1.0     5.0  1
1     2.0  Filled  2
2  Filled  Filled  3

In [17]:
#Filling missing value
df.fillna('Filled') #first argument is of value

        A       B  C
0     1.0     5.0  1
1     2.0  Filled  2
2  Filled  Filled  3

In [19]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [25]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64